Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32373C-EVAL.c
remaps_t remaps {
    { I2C1  , SCL  , GPIOB, GPIO_PIN_6  , GPIO_AF4_I2C1                      },
    { I2C1  , SCL  , GPIOB, GPIO_PIN_8  , GPIO_AF4_I2C1                      },
    { I2C1  , SCL  , GPIOA, GPIO_PIN_15 , GPIO_AF4_I2C1                      },
    { I2C1  , SDA  , GPIOB, GPIO_PIN_7  , GPIO_AF4_I2C1                      },
    { I2C1  , SDA  , GPIOB, GPIO_PIN_9  , GPIO_AF4_I2C1                      },
    { I2C1  , SDA  , GPIOA, GPIO_PIN_14 , GPIO_AF4_I2C1                      },
    { I2C2  , SCL  , GPIOF, GPIO_PIN_1  , GPIO_AF4_I2C2                      },
    { I2C2  , SCL  , GPIOA, GPIO_PIN_9  , GPIO_AF4_I2C2                      },
    { I2C2  , SCL  , GPIOF, GPIO_PIN_6  , GPIO_AF4_I2C2                      },
    { I2C2  , SDA  , GPIOF, GPIO_PIN_0  , GPIO_AF4_I2C2                      },
    { I2C2  , SDA  , GPIOA, GPIO_PIN_10 , GPIO_AF4_I2C2                      },
    { SPI1  , MISO , GPIOA, GPIO_PIN_13 , GPIO_AF6_SPI1                      },
    { SPI1  , MISO , GPIOC, GPIO_PIN_8  , GPIO_AF5_SPI1                      },
    { SPI1  , MISO , GPIOA, GPIO_PIN_6  , GPIO_AF5_SPI1                      },
    { SPI1  , MISO , GPIOB, GPIO_PIN_4  , GPIO_AF5_SPI1                      },
    { SPI1  , MOSI , GPIOB, GPIO_PIN_5  , GPIO_AF5_SPI1                      },
    { SPI1  , MOSI , GPIOC, GPIO_PIN_9  , GPIO_AF5_SPI1                      },
    { SPI1  , MOSI , GPIOF, GPIO_PIN_6  , GPIO_AF5_SPI1                      },
    { SPI1  , MOSI , GPIOB, GPIO_PIN_0  , GPIO_AF5_SPI1                      },
    { SPI1  , MOSI , GPIOA, GPIO_PIN_7  , GPIO_AF5_SPI1                      },
    { SPI1  , SCK  , GPIOA, GPIO_PIN_12 , GPIO_AF6_SPI1                      },
    { SPI1  , SCK  , GPIOA, GPIO_PIN_5  , GPIO_AF5_SPI1                      },
    { SPI1  , SCK  , GPIOB, GPIO_PIN_3  , GPIO_AF5_SPI1                      },
    { SPI1  , SCK  , GPIOC, GPIO_PIN_7  , GPIO_AF5_SPI1                      },
    { SPI2  , MISO , GPIOC, GPIO_PIN_2  , GPIO_AF5_SPI2                      },
    { SPI2  , MISO , GPIOA, GPIO_PIN_9  , GPIO_AF5_SPI2                      },
    { SPI2  , MISO , GPIOD, GPIO_PIN_3  , GPIO_AF5_SPI2                      },
    { SPI2  , MISO , GPIOB, GPIO_PIN_14 , GPIO_AF5_SPI2                      },
    { SPI2  , MOSI , GPIOC, GPIO_PIN_3  , GPIO_AF5_SPI2                      },
    { SPI2  , MOSI , GPIOA, GPIO_PIN_10 , GPIO_AF5_SPI2                      },
    { SPI2  , MOSI , GPIOD, GPIO_PIN_4  , GPIO_AF5_SPI2                      },
    { SPI2  , MOSI , GPIOB, GPIO_PIN_15 , GPIO_AF5_SPI2                      },
    { SPI2  , SCK  , GPIOA, GPIO_PIN_8  , GPIO_AF5_SPI2                      },
    { SPI2  , SCK  , GPIOB, GPIO_PIN_10 , GPIO_AF5_SPI2                      },
    { SPI2  , SCK  , GPIOD, GPIO_PIN_8  , GPIO_AF5_SPI2                      },
    { SPI2  , SCK  , GPIOB, GPIO_PIN_8  , GPIO_AF5_SPI2                      },
    { SPI2  , SCK  , GPIOD, GPIO_PIN_7  , GPIO_AF5_SPI2                      },
    { SPI3  , MISO , GPIOB, GPIO_PIN_4  , GPIO_AF6_SPI3                      },
    { SPI3  , MISO , GPIOA, GPIO_PIN_2  , GPIO_AF6_SPI3                      },
    { SPI3  , MISO , GPIOC, GPIO_PIN_11 , GPIO_AF6_SPI3                      },
    { SPI3  , MOSI , GPIOB, GPIO_PIN_5  , GPIO_AF6_SPI3                      },
    { SPI3  , MOSI , GPIOA, GPIO_PIN_3  , GPIO_AF6_SPI3                      },
    { SPI3  , MOSI , GPIOC, GPIO_PIN_12 , GPIO_AF6_SPI3                      },
    { SPI3  , SCK  , GPIOA, GPIO_PIN_1  , GPIO_AF6_SPI3                      },
    { SPI3  , SCK  , GPIOC, GPIO_PIN_10 , GPIO_AF6_SPI3                      },
    { SPI3  , SCK  , GPIOB, GPIO_PIN_3  , GPIO_AF6_SPI3                      },
    { TIM12 , CH1  , GPIOA, GPIO_PIN_4  , GPIO_AF10_TIM12                    },
    { TIM12 , CH1  , GPIOB, GPIO_PIN_14 , GPIO_AF9_TIM12                     },
    { TIM12 , CH1  , GPIOA, GPIO_PIN_14 , GPIO_AF10_TIM12                    },
    { TIM12 , CH2  , GPIOB, GPIO_PIN_15 , GPIO_AF9_TIM12                     },
    { TIM12 , CH2  , GPIOA, GPIO_PIN_5  , GPIO_AF10_TIM12                    },
    { TIM12 , CH2  , GPIOA, GPIO_PIN_15 , GPIO_AF10_TIM12                    },
    { TIM13 , CH1  , GPIOC, GPIO_PIN_4  , GPIO_AF2_TIM13                     },
    { TIM13 , CH1  , GPIOA, GPIO_PIN_9  , GPIO_AF2_TIM13                     },
    { TIM13 , CH1  , GPIOB, GPIO_PIN_3  , GPIO_AF9_TIM13                     },
    { TIM13 , CH1  , GPIOA, GPIO_PIN_6  , GPIO_AF9_TIM13                     },
    { TIM14 , CH1  , GPIOF, GPIO_PIN_9  , GPIO_AF2_TIM14                     },
    { TIM14 , CH1  , GPIOA, GPIO_PIN_10 , GPIO_AF9_TIM14                     },
    { TIM14 , CH1  , GPIOA, GPIO_PIN_5  , GPIO_AF9_TIM14                     },
    { TIM14 , CH1  , GPIOA, GPIO_PIN_7  , GPIO_AF9_TIM14                     },
    { TIM15 , CH1  , GPIOA, GPIO_PIN_2  , GPIO_AF9_TIM15                     },
    { TIM15 , CH1  , GPIOB, GPIO_PIN_6  , GPIO_AF9_TIM15                     },
    { TIM15 , CH1  , GPIOB, GPIO_PIN_14 , GPIO_AF1_TIM15                     },
    { TIM15 , CH1N , GPIOA, GPIO_PIN_1  , GPIO_AF9_TIM15                     },
    { TIM15 , CH1N , GPIOB, GPIO_PIN_15 , GPIO_AF2_TIM15                     },
    { TIM15 , CH1N , GPIOB, GPIO_PIN_4  , GPIO_AF9_TIM15                     },
    { TIM15 , CH2  , GPIOB, GPIO_PIN_7  , GPIO_AF9_TIM15                     },
    { TIM15 , CH2  , GPIOA, GPIO_PIN_3  , GPIO_AF9_TIM15                     },
    { TIM15 , CH2  , GPIOB, GPIO_PIN_15 , GPIO_AF1_TIM15                     },
    { TIM16 , CH1  , GPIOA, GPIO_PIN_12 , GPIO_AF1_TIM16                     },
    { TIM16 , CH1  , GPIOB, GPIO_PIN_4  , GPIO_AF1_TIM16                     },
    { TIM16 , CH1  , GPIOB, GPIO_PIN_8  , GPIO_AF1_TIM16                     },
    { TIM16 , CH1  , GPIOA, GPIO_PIN_6  , GPIO_AF1_TIM16                     },
    { TIM16 , CH1N , GPIOA, GPIO_PIN_13 , GPIO_AF1_TIM16                     },
    { TIM16 , CH1N , GPIOB, GPIO_PIN_6  , GPIO_AF1_TIM16                     },
    { TIM17 , CH1  , GPIOB, GPIO_PIN_5  , GPIO_AF10_TIM17                    },
    { TIM17 , CH1  , GPIOB, GPIO_PIN_9  , GPIO_AF1_TIM17                     },
    { TIM17 , CH1  , GPIOA, GPIO_PIN_7  , GPIO_AF1_TIM17                     },
    { TIM17 , CH1N , GPIOB, GPIO_PIN_7  , GPIO_AF1_TIM17                     },
    { TIM19 , CH1  , GPIOA, GPIO_PIN_0  , GPIO_AF11_TIM19                    },
    { TIM19 , CH1  , GPIOB, GPIO_PIN_6  , GPIO_AF11_TIM19                    },
    { TIM19 , CH1  , GPIOC, GPIO_PIN_10 , GPIO_AF2_TIM19                     },
    { TIM19 , CH2  , GPIOA, GPIO_PIN_1  , GPIO_AF11_TIM19                    },
    { TIM19 , CH2  , GPIOB, GPIO_PIN_7  , GPIO_AF11_TIM19                    },
    { TIM19 , CH2  , GPIOC, GPIO_PIN_11 , GPIO_AF2_TIM19                     },
    { TIM19 , CH3  , GPIOA, GPIO_PIN_2  , GPIO_AF11_TIM19                    },
    { TIM19 , CH3  , GPIOB, GPIO_PIN_8  , GPIO_AF11_TIM19                    },
    { TIM19 , CH3  , GPIOC, GPIO_PIN_12 , GPIO_AF2_TIM19                     },
    { TIM19 , CH4  , GPIOA, GPIO_PIN_3  , GPIO_AF11_TIM19                    },
    { TIM19 , CH4  , GPIOB, GPIO_PIN_9  , GPIO_AF11_TIM19                    },
    { TIM19 , CH4  , GPIOD, GPIO_PIN_0  , GPIO_AF2_TIM19                     },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_0  , GPIO_AF1_TIM2                      },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_5  , GPIO_AF1_TIM2                      },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_15 , GPIO_AF1_TIM2                      },
    { TIM2  , CH2  , GPIOA, GPIO_PIN_1  , GPIO_AF1_TIM2                      },
    { TIM2  , CH2  , GPIOB, GPIO_PIN_3  , GPIO_AF1_TIM2                      },
    { TIM2  , CH3  , GPIOA, GPIO_PIN_9  , GPIO_AF10_TIM2                     },
    { TIM2  , CH3  , GPIOA, GPIO_PIN_2  , GPIO_AF1_TIM2                      },
    { TIM2  , CH3  , GPIOB, GPIO_PIN_10 , GPIO_AF1_TIM2                      },
    { TIM2  , CH4  , GPIOA, GPIO_PIN_10 , GPIO_AF10_TIM2                     },
    { TIM2  , CH4  , GPIOA, GPIO_PIN_3  , GPIO_AF1_TIM2                      },
    { TIM3  , CH1  , GPIOB, GPIO_PIN_4  , GPIO_AF2_TIM3                      },
    { TIM3  , CH1  , GPIOC, GPIO_PIN_6  , GPIO_AF2_TIM3                      },
    { TIM3  , CH1  , GPIOA, GPIO_PIN_6  , GPIO_AF2_TIM3                      },
    { TIM3  , CH2  , GPIOB, GPIO_PIN_5  , GPIO_AF2_TIM3                      },
    { TIM3  , CH2  , GPIOC, GPIO_PIN_7  , GPIO_AF2_TIM3                      },
    { TIM3  , CH2  , GPIOA, GPIO_PIN_4  , GPIO_AF2_TIM3                      },
    { TIM3  , CH2  , GPIOB, GPIO_PIN_0  , GPIO_AF10_TIM3                     },
    { TIM3  , CH2  , GPIOA, GPIO_PIN_7  , GPIO_AF2_TIM3                      },
    { TIM3  , CH3  , GPIOC, GPIO_PIN_8  , GPIO_AF2_TIM3                      },
    { TIM3  , CH3  , GPIOB, GPIO_PIN_6  , GPIO_AF10_TIM3                     },
    { TIM3  , CH3  , GPIOB, GPIO_PIN_0  , GPIO_AF2_TIM3                      },
    { TIM3  , CH4  , GPIOB, GPIO_PIN_7  , GPIO_AF10_TIM3                     },
    { TIM3  , CH4  , GPIOC, GPIO_PIN_9  , GPIO_AF2_TIM3                      },
    { TIM3  , CH4  , GPIOB, GPIO_PIN_1  , GPIO_AF2_TIM3                      },
    { TIM4  , CH1  , GPIOD, GPIO_PIN_12 , GPIO_AF2_TIM4                      },
    { TIM4  , CH1  , GPIOA, GPIO_PIN_11 , GPIO_AF10_TIM4                     },
    { TIM4  , CH1  , GPIOB, GPIO_PIN_6  , GPIO_AF2_TIM4                      },
    { TIM4  , CH2  , GPIOA, GPIO_PIN_12 , GPIO_AF10_TIM4                     },
    { TIM4  , CH2  , GPIOD, GPIO_PIN_13 , GPIO_AF2_TIM4                      },
    { TIM4  , CH2  , GPIOB, GPIO_PIN_7  , GPIO_AF2_TIM4                      },
    { TIM4  , CH3  , GPIOA, GPIO_PIN_13 , GPIO_AF10_TIM4                     },
    { TIM4  , CH3  , GPIOB, GPIO_PIN_8  , GPIO_AF2_TIM4                      },
    { TIM4  , CH3  , GPIOD, GPIO_PIN_14 , GPIO_AF2_TIM4                      },
    { TIM4  , CH4  , GPIOB, GPIO_PIN_9  , GPIO_AF2_TIM4                      },
    { TIM4  , CH4  , GPIOD, GPIO_PIN_15 , GPIO_AF2_TIM4                      },
    { TIM4  , CH4  , GPIOF, GPIO_PIN_6  , GPIO_AF2_TIM4                      },
    { TIM5  , CH1  , GPIOA, GPIO_PIN_0  , GPIO_AF2_TIM5                      },
    { TIM5  , CH1  , GPIOA, GPIO_PIN_8  , GPIO_AF2_TIM5                      },
    { TIM5  , CH1  , GPIOC, GPIO_PIN_0  , GPIO_AF2_TIM5                      },
    { TIM5  , CH2  , GPIOA, GPIO_PIN_1  , GPIO_AF2_TIM5                      },
    { TIM5  , CH2  , GPIOA, GPIO_PIN_11 , GPIO_AF2_TIM5                      },
    { TIM5  , CH2  , GPIOC, GPIO_PIN_1  , GPIO_AF2_TIM5                      },
    { TIM5  , CH3  , GPIOA, GPIO_PIN_12 , GPIO_AF2_TIM5                      },
    { TIM5  , CH3  , GPIOC, GPIO_PIN_2  , GPIO_AF2_TIM5                      },
    { TIM5  , CH3  , GPIOA, GPIO_PIN_2  , GPIO_AF2_TIM5                      },
    { TIM5  , CH4  , GPIOA, GPIO_PIN_13 , GPIO_AF2_TIM5                      },
    { TIM5  , CH4  , GPIOA, GPIO_PIN_3  , GPIO_AF2_TIM5                      },
    { TIM5  , CH4  , GPIOC, GPIO_PIN_3  , GPIO_AF2_TIM5                      },
    { USART1, RX   , GPIOA, GPIO_PIN_10 , GPIO_AF7_USART1                    },
    { USART1, RX   , GPIOB, GPIO_PIN_7  , GPIO_AF7_USART1                    },
    { USART1, RX   , GPIOE, GPIO_PIN_1  , GPIO_AF7_USART1                    },
    { USART1, RX   , GPIOC, GPIO_PIN_5  , GPIO_AF7_USART1                    },
    { USART1, TX   , GPIOA, GPIO_PIN_9  , GPIO_AF7_USART1                    },
    { USART1, TX   , GPIOB, GPIO_PIN_6  , GPIO_AF7_USART1                    },
    { USART1, TX   , GPIOE, GPIO_PIN_0  , GPIO_AF7_USART1                    },
    { USART1, TX   , GPIOC, GPIO_PIN_4  , GPIO_AF7_USART1                    },
    { USART2, RX   , GPIOB, GPIO_PIN_4  , GPIO_AF7_USART2                    },
    { USART2, RX   , GPIOA, GPIO_PIN_3  , GPIO_AF7_USART2                    },
    { USART2, RX   , GPIOD, GPIO_PIN_6  , GPIO_AF7_USART2                    },
    { USART2, TX   , GPIOA, GPIO_PIN_2  , GPIO_AF7_USART2                    },
    { USART2, TX   , GPIOD, GPIO_PIN_5  , GPIO_AF7_USART2                    },
    { USART2, TX   , GPIOB, GPIO_PIN_3  , GPIO_AF7_USART2                    },
    { USART3, RX   , GPIOE, GPIO_PIN_15 , GPIO_AF7_USART3                    },
    { USART3, RX   , GPIOB, GPIO_PIN_9  , GPIO_AF7_USART3                    },
    { USART3, RX   , GPIOC, GPIO_PIN_11 , GPIO_AF7_USART3                    },
    { USART3, RX   , GPIOD, GPIO_PIN_9  , GPIO_AF7_USART3                    },
    { USART3, TX   , GPIOB, GPIO_PIN_10 , GPIO_AF7_USART3                    },
    { USART3, TX   , GPIOC, GPIO_PIN_10 , GPIO_AF7_USART3                    },
    { USART3, TX   , GPIOB, GPIO_PIN_8  , GPIO_AF7_USART3                    },
    { USART3, TX   , GPIOD, GPIO_PIN_8  , GPIO_AF7_USART3                    },
};
